Ran Plan for 2 projects:

1. project: `vpc-dev` dir: `infrastructure` workspace: `default`
1. project: `vpc-production` dir: `infrastructure` workspace: `default`

### 1. project: `vpc-dev` dir: `infrastructure` workspace: `default`
<details><summary>Show Output</summary>

```diff
module.vpc.data.aws_availability_zones.available: Reading...
module.vpc.data.aws_availability_zones.available: Read complete after 0s [id=eu-west-1]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # module.vpc.aws_internet_gateway.int_gw will be created
+ resource "aws_internet_gateway" "int_gw" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Name"        = "Development-igw"
          + "environment" = "Development"
          + "location"    = "Cardiff"
          + "project"     = "Fox"
        }
      + tags_all = {
          + "Name"        = "Development-igw"
          + "environment" = "Development"
          + "location"    = "Cardiff"
          + "project"     = "Fox"
        }
      + vpc_id   = (known after apply)
    }

  # module.vpc.aws_route.public_default will be created
+ resource "aws_route" "public_default" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
    }

  # module.vpc.aws_route_table.database will be created
+ resource "aws_route_table" "database" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name"        = "Development-database-route"
          + "environment" = "Development"
          + "location"    = "Cardiff"
          + "project"     = "Fox"
        }
      + tags_all         = {
          + "Name"        = "Development-database-route"
          + "environment" = "Development"
          + "location"    = "Cardiff"
          + "project"     = "Fox"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table.private will be created
+ resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name"        = "Development-private-route"
          + "environment" = "Development"
          + "location"    = "Cardiff"
          + "project"     = "Fox"
        }
      + tags_all         = {
          + "Name"        = "Development-private-route"
          + "environment" = "Development"
          + "location"    = "Cardiff"
          + "project"     = "Fox"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table.public will be created
+ resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name"        = "Development-public-route"
          + "environment" = "Development"
          + "location"    = "Cardiff"
          + "project"     = "Fox"
        }
      + tags_all         = {
          + "Name"        = "Development-public-route"
          + "environment" = "Development"
          + "location"    = "Cardiff"
          + "project"     = "Fox"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table_association.database1 will be created
+ resource "aws_route_table_association" "database1" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.database2 will be created
+ resource "aws_route_table_association" "database2" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.private_subnet1_association will be created
+ resource "aws_route_table_association" "private_subnet1_association" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.private_subnet2_association will be created
+ resource "aws_route_table_association" "private_subnet2_association" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public_subnet1_association will be created
+ resource "aws_route_table_association" "public_subnet1_association" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public_subnet2_association will be created
+ resource "aws_route_table_association" "public_subnet2_association" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_subnet.db1 will be created
+ resource "aws_subnet" "db1" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-west-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.4.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"        = "Development-db1"
          + "environment" = "Development"
          + "location"    = "Cardiff"
          + "project"     = "Fox"
        }
      + tags_all                                       = {
          + "Name"        = "Development-db1"
          + "environment" = "Development"
          + "location"    = "Cardiff"
          + "project"     = "Fox"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.db2 will be created
+ resource "aws_subnet" "db2" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-west-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.5.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"        = "Development-db2"
          + "environment" = "Development"
          + "location"    = "Cardiff"
          + "project"     = "Fox"
        }
      + tags_all                                       = {
          + "Name"        = "Development-db2"
          + "environment" = "Development"
          + "location"    = "Cardiff"
          + "project"     = "Fox"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.priv_1 will be created
+ resource "aws_subnet" "priv_1" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-west-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.2.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"        = "Development-priv_1"
          + "environment" = "Development"
          + "location"    = "Cardiff"
          + "project"     = "Fox"
        }
      + tags_all                                       = {
          + "Name"        = "Development-priv_1"
          + "environment" = "Development"
          + "location"    = "Cardiff"
          + "project"     = "Fox"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.priv_2 will be created
+ resource "aws_subnet" "priv_2" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-west-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.3.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"        = "Development-priv_2"
          + "environment" = "Development"
          + "location"    = "Cardiff"
          + "project"     = "Fox"
        }
      + tags_all                                       = {
          + "Name"        = "Development-priv_2"
          + "environment" = "Development"
          + "location"    = "Cardiff"
          + "project"     = "Fox"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.pub_1 will be created
+ resource "aws_subnet" "pub_1" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-west-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.0.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"        = "Development-pub_1"
          + "environment" = "Development"
          + "location"    = "Cardiff"
          + "project"     = "Fox"
        }
      + tags_all                                       = {
          + "Name"        = "Development-pub_1"
          + "environment" = "Development"
          + "location"    = "Cardiff"
          + "project"     = "Fox"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.pub_2 will be created
+ resource "aws_subnet" "pub_2" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-west-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"        = "Development-pub_2"
          + "environment" = "Development"
          + "location"    = "Cardiff"
          + "project"     = "Fox"
        }
      + tags_all                                       = {
          + "Name"        = "Development-pub_2"
          + "environment" = "Development"
          + "location"    = "Cardiff"
          + "project"     = "Fox"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_vpc.vpc will be created
+ resource "aws_vpc" "vpc" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.0.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Name"        = "Development-vpc"
          + "environment" = "Development"
          + "location"    = "Cardiff"
          + "project"     = "Fox"
        }
      + tags_all                             = {
          + "Name"        = "Development-vpc"
          + "environment" = "Development"
          + "location"    = "Cardiff"
          + "project"     = "Fox"
        }
    }

Plan: 18 to add, 0 to change, 0 to destroy.


```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p vpc-dev`
* :put_litter_in_its_place: To **delete** this plan click [here](http://atlantis.alexmelidevops.cloud/lock?id=jalexkam%252Fbasic-terraform%252Finfrastructure%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p vpc-dev`
</details>
Plan: 18 to add, 0 to change, 0 to destroy.

---
### 2. project: `vpc-production` dir: `infrastructure` workspace: `default`
<details><summary>Show Output</summary>

```diff
module.vpc.data.aws_availability_zones.available: Reading...
module.vpc.data.aws_availability_zones.available: Read complete after 0s [id=us-east-1]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # module.vpc.aws_internet_gateway.int_gw will be created
+ resource "aws_internet_gateway" "int_gw" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Name"        = "Production-igw"
          + "environment" = "Production"
          + "location"    = "USA"
          + "project"     = "Fox"
        }
      + tags_all = {
          + "Name"        = "Production-igw"
          + "environment" = "Production"
          + "location"    = "USA"
          + "project"     = "Fox"
        }
      + vpc_id   = (known after apply)
    }

  # module.vpc.aws_route.public_default will be created
+ resource "aws_route" "public_default" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
    }

  # module.vpc.aws_route_table.database will be created
+ resource "aws_route_table" "database" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name"        = "Production-database-route"
          + "environment" = "Production"
          + "location"    = "USA"
          + "project"     = "Fox"
        }
      + tags_all         = {
          + "Name"        = "Production-database-route"
          + "environment" = "Production"
          + "location"    = "USA"
          + "project"     = "Fox"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table.private will be created
+ resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name"        = "Production-private-route"
          + "environment" = "Production"
          + "location"    = "USA"
          + "project"     = "Fox"
        }
      + tags_all         = {
          + "Name"        = "Production-private-route"
          + "environment" = "Production"
          + "location"    = "USA"
          + "project"     = "Fox"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table.public will be created
+ resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name"        = "Production-public-route"
          + "environment" = "Production"
          + "location"    = "USA"
          + "project"     = "Fox"
        }
      + tags_all         = {
          + "Name"        = "Production-public-route"
          + "environment" = "Production"
          + "location"    = "USA"
          + "project"     = "Fox"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table_association.database1 will be created
+ resource "aws_route_table_association" "database1" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.database2 will be created
+ resource "aws_route_table_association" "database2" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.private_subnet1_association will be created
+ resource "aws_route_table_association" "private_subnet1_association" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.private_subnet2_association will be created
+ resource "aws_route_table_association" "private_subnet2_association" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public_subnet1_association will be created
+ resource "aws_route_table_association" "public_subnet1_association" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public_subnet2_association will be created
+ resource "aws_route_table_association" "public_subnet2_association" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_subnet.db1 will be created
+ resource "aws_subnet" "db1" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.4.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"        = "Production-db1"
          + "environment" = "Production"
          + "location"    = "USA"
          + "project"     = "Fox"
        }
      + tags_all                                       = {
          + "Name"        = "Production-db1"
          + "environment" = "Production"
          + "location"    = "USA"
          + "project"     = "Fox"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.db2 will be created
+ resource "aws_subnet" "db2" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.5.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"        = "Production-db2"
          + "environment" = "Production"
          + "location"    = "USA"
          + "project"     = "Fox"
        }
      + tags_all                                       = {
          + "Name"        = "Production-db2"
          + "environment" = "Production"
          + "location"    = "USA"
          + "project"     = "Fox"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.priv_1 will be created
+ resource "aws_subnet" "priv_1" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.2.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"        = "Production-priv_1"
          + "environment" = "Production"
          + "location"    = "USA"
          + "project"     = "Fox"
        }
      + tags_all                                       = {
          + "Name"        = "Production-priv_1"
          + "environment" = "Production"
          + "location"    = "USA"
          + "project"     = "Fox"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.priv_2 will be created
+ resource "aws_subnet" "priv_2" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.3.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"        = "Production-priv_2"
          + "environment" = "Production"
          + "location"    = "USA"
          + "project"     = "Fox"
        }
      + tags_all                                       = {
          + "Name"        = "Production-priv_2"
          + "environment" = "Production"
          + "location"    = "USA"
          + "project"     = "Fox"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.pub_1 will be created
+ resource "aws_subnet" "pub_1" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.0.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"        = "Production-pub_1"
          + "environment" = "Production"
          + "location"    = "USA"
          + "project"     = "Fox"
        }
      + tags_all                                       = {
          + "Name"        = "Production-pub_1"
          + "environment" = "Production"
          + "location"    = "USA"
          + "project"     = "Fox"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.pub_2 will be created
+ resource "aws_subnet" "pub_2" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"        = "Production-pub_2"
          + "environment" = "Production"
          + "location"    = "USA"
          + "project"     = "Fox"
        }
      + tags_all                                       = {
          + "Name"        = "Production-pub_2"
          + "environment" = "Production"
          + "location"    = "USA"
          + "project"     = "Fox"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_vpc.vpc will be created
+ resource "aws_vpc" "vpc" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.0.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Name"        = "Production-vpc"
          + "environment" = "Production"
          + "location"    = "USA"
          + "project"     = "Fox"
        }
      + tags_all                             = {
          + "Name"        = "Production-vpc"
          + "environment" = "Production"
          + "location"    = "USA"
          + "project"     = "Fox"
        }
    }

Plan: 18 to add, 0 to change, 0 to destroy.


```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p vpc-production`
* :put_litter_in_its_place: To **delete** this plan click [here](http://atlantis.alexmelidevops.cloud/lock?id=jalexkam%252Fbasic-terraform%252Finfrastructure%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p vpc-production`
</details>
Plan: 18 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
